\connect demo_db;

drop table if exists demo_schema.demo_metrics;

-- === Создание таблицы =====================================================================

create table demo_schema.demo_metrics (
	ts timestamptz not null,
	group_name varchar(200) not null,
	metric varchar(200) not null,
	value bigint
);

-- === Зачистка =====================================================================

truncate demo_schema.demo_metrics;

-- === Данные =====================================================================

insert into demo_schema.demo_metrics (
    ts, group_name, metric, value
) values
-- Хост 1 - базовая метрика "ram", данные минутные в одном часу
(   '2025-01-01 10:00:00 +0300', 'host-1', 'ram', 100 ),
(   '2025-01-01 10:01:00 +0300', 'host-1', 'ram', 110 ),
(   '2025-01-01 10:02:00 +0300', 'host-1', 'ram', 120 ),
(   '2025-01-01 10:03:00 +0300', 'host-1', 'ram', 130 ),
(   '2025-01-01 10:04:00 +0300', 'host-1', 'ram', 170 ),
(   '2025-01-01 10:05:00 +0300', 'host-1', 'ram', 190 ),
(   '2025-01-01 10:06:00 +0300', 'host-1', 'ram', 100 ),
(   '2025-01-01 10:07:00 +0300', 'host-1', 'ram', 190 ),
(   '2025-01-01 10:08:00 +0300', 'host-1', 'ram', 180 ),
(   '2025-01-01 10:09:00 +0300', 'host-1', 'ram',  90 ),
-- Другой хост и данные за 3 часа  - Хост 2
(   '2025-01-01 10:00:00 +0300', 'host-2', 'ram', 1100 ),
(   '2025-01-01 10:01:00 +0300', 'host-2', 'ram', 1110 ),
(   '2025-01-01 10:02:00 +0300', 'host-2', 'ram', 1120 ),
(   '2025-01-01 10:53:00 +0300', 'host-2', 'ram', 1130 ),
(   '2025-01-01 10:54:00 +0300', 'host-2', 'ram', 1140 ),
(   '2025-01-01 11:35:00 +0300', 'host-2', 'ram', 1130 ),
(   '2025-01-01 11:36:00 +0300', 'host-2', 'ram', 1100 ),
(   '2025-01-01 12:07:00 +0300', 'host-2', 'ram', 1190 ),
(   '2025-01-01 12:08:00 +0300', 'host-2', 'ram', 1180 ),
(   '2025-01-01 12:49:00 +0300', 'host-2', 'ram', 1090 ),
-- Другая метрика и записи днём ранее / днём позже - "hdd"
(   '2024-12-31 19:00:00 +0300', 'host-1', 'hdd', 2000 ),
(   '2025-01-01 10:00:00 +0300', 'host-1', 'hdd', 2190 ),
(   '2025-01-01 10:01:00 +0300', 'host-1', 'hdd', 2180 ),
(   '2025-01-01 10:02:00 +0300', 'host-1', 'hdd', 2180 ),
(   '2025-01-01 10:03:00 +0300', 'host-1', 'hdd', 2160 ),
(   '2025-01-01 10:04:00 +0300', 'host-1', 'hdd', 2150 ),
(   '2025-01-01 10:05:00 +0300', 'host-1', 'hdd', 2140 ),
(   '2025-01-01 10:06:00 +0300', 'host-1', 'hdd', 2130 ),
(   '2025-01-01 10:07:00 +0300', 'host-1', 'hdd', 2181 ),
(   '2025-01-01 10:08:00 +0300', 'host-1', 'hdd', 2191 ),
(   '2025-01-01 10:09:00 +0300', 'host-1', 'hdd', 2150 ),
(   '2025-01-02 10:00:00 +0300', 'host-1', 'hdd', 2450 )
;


grant all on all tables in schema demo_schema to demo_role;
alter table demo_schema.demo_data owner to demo_user;

\q
